Requirements for this tutorial: 
1.Python Environment: Please visit https://youtu.be/4pQ2xFaU-C8 
2.Install numpy: pip install pandas

## Why Pandas?
Python library which provides easy to use data structures and inbuilt methods to do data analysis. It is built on top of numpy.

## Data structures in Pandas:
1.Series
2.DataFrame

## 1.Series:
1.One Dimensional labelled array
2.Size immutable but value is mutable

In [1]:
import numpy as np
import pandas as pd

In [2]:
##Creating series from array
array_1=np.array(['Lion','Tiger','Cheetah','Panther'])
series_way1=pd.Series(array_1)
print(series_way1)

0       Lion
1      Tiger
2    Cheetah
3    Panther
dtype: object

In [3]:
#Creating series with label
series_way2=pd.Series(array_1,index=[10,20,30,40])
print(series_way2)

10       Lion
20      Tiger
30    Cheetah
40    Panther
dtype: object

In [4]:
#Creating series with list
list1=[92,93,94,95]
series_way3=pd.Series(list1,index=['Maths','Sanskrit','Physics','Chemistry'])
print(series_way3)

Maths        92
Sanskrit     93
Physics      94
Chemistry    95
dtype: int64

In [5]:
#Creating series with dictionary
dictionary1={'Maths':92,'Sanskrit':93,'Physics':94,'Chemistry':95}
series_way4=pd.Series(dictionary1)
print(series_way4)

Maths        92
Sanskrit     93
Physics      94
Chemistry    95
dtype: int64

In [6]:
#Accessing elements from series using position
print(series_way4[2])

94

In [7]:
#Accessing elements from series using index value
print(series_way4['Sanskrit'])

93

In [8]:
#Retrieving multiple elements
print(series_way4[['Sanskrit','Maths']])

Sanskrit    93
Maths       92
dtype: int64

## 2.DataFrame
Two dimensional data structure arranged as rows and columns.
Columns can be of different datatype
Both size and value is mutable

In [9]:
#Creating dataframe using list
list_1=[92,93,94,95]
dataframe_way1=pd.DataFrame(list_1)
print(dataframe_way1)

    0
0  92
1  93
2  94
3  95

In [10]:
#Creating dataframe using list of lists
list_2=[['Maths',92],['Sanskrit',93],['Physics',94],['Chemistry',95]]
dataframe_way2=pd.DataFrame(list_2,columns=['Subject','Marks'],dtype=int)
print(dataframe_way2)

     Subject  Marks
0      Maths     92
1   Sanskrit     93
2    Physics     94
3  Chemistry     95

In [11]:
#Creating dataframe using dictionary of lists
list_3={'Subject':['Maths','Sanskrit','Physics','Chemistry'],'Marks':[92,93,94,95]}
dataframe_way3=pd.DataFrame(list_3)
print(dataframe_way3)

     Subject  Marks
0      Maths     92
1   Sanskrit     93
2    Physics     94
3  Chemistry     95

In [12]:
#Creating dataframe using list of dictionaries
list_4=[{'Maths':92,'Sanskrit':93,'Physics':94,'Chemistry':95},{'Maths':82,'Sanskrit':83,'Physics':84,'Chemistry':85}]
dataframe_way4=pd.DataFrame(list_4,index=['Semester1','Semester2'])
print(dataframe_way4)

           Maths  Sanskrit  Physics  Chemistry
Semester1     92        93       94         95
Semester2     82        83       84         85

In [13]:
#Creating dataframe using Dictionaries of series
series_5={'Subject':pd.Series(['Maths','Sanskrit','Physics','Chemistry']),'Marks':pd.Series([92,93,94,95])}
dataframe_way5=pd.DataFrame(series_5)
print(dataframe_way5)

     Subject  Marks
0      Maths     92
1   Sanskrit     93
2    Physics     94
3  Chemistry     95

In [14]:
#Selecting column
print(dataframe_way5['Subject'])

0        Maths
1     Sanskrit
2      Physics
3    Chemistry
Name: Subject, dtype: object

In [15]:
dataframe_way5['Grade']=['A+','A+','A+','A+']
print(dataframe_way5)

     Subject  Marks Grade
0      Maths     92    A+
1   Sanskrit     93    A+
2    Physics     94    A+
3  Chemistry     95    A+

In [16]:
dataframe_way5.pop('Grade')
print(dataframe_way5)

     Subject  Marks
0      Maths     92
1   Sanskrit     93
2    Physics     94
3  Chemistry     95

In [17]:
#Getting columns
print(dataframe_way5.columns)

Index(['Subject', 'Marks'], dtype='object')

In [18]:
print(dataframe_way5.head(3))  #By default it's 5

    Subject  Marks
0     Maths     92
1  Sanskrit     93
2   Physics     94

In [19]:
#Creating dataframe using list of dictionaries
list_5=[{'Maths':92,'Sanskrit':93,'Physics':94,'Chemistry':95,'History':85,'Geography':80,'English':78},{'Maths':87,'Sanskrit':91,'Physics':89,'Chemistry':85,'History':80,'Geography':75,'English':83},{'Maths':90,'Sanskrit':91,'Physics':78,'Chemistry':81,'History':82,'Geography':76,'English':82},{'Maths':96,'Sanskrit':90,'Physics':80,'Chemistry':81,'History':78,'Geography':72,'English':81},{'Maths':88,'Sanskrit':90,'Physics':75,'Chemistry':71,'History':82,'Geography':72,'English':83}]
dataframe_way5=pd.DataFrame(list_5,index=['exam1','exam2','exam3','exam4','exam5'])
print(dataframe_way5)

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam1     92        93       94         95       85         80       78
exam2     87        91       89         85       80         75       83
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81
exam5     88        90       75         71       82         72       83

In [20]:
#loc and iloc:loc works on index labels(here it is exam1,exam2,exam3,exam4,exam5) whereas iloc works on index numbers
print(dataframe_way5.loc['exam3'])

Maths        90
Sanskrit     91
Physics      78
Chemistry    81
History      82
Geography    76
English      82
Name: exam3, dtype: int64

In [21]:
#We can get the same result using iloc as below
print(dataframe_way5.iloc[2])  #2 is the index for exam3

Maths        90
Sanskrit     91
Physics      78
Chemistry    81
History      82
Geography    76
English      82
Name: exam3, dtype: int64

In [22]:
#Getting a particular column value
dataframe_way5['Maths']

exam1    92
exam2    87
exam3    90
exam4    96
exam5    88
Name: Maths, dtype: int64

In [23]:
#Getting multiple columns
dataframe_way5[['Maths','Chemistry','History']]

       Maths  Chemistry  History
exam1     92         95       85
exam2     87         85       80
exam3     90         81       82
exam4     96         81       78
exam5     88         71       82

In [24]:
#Basic statistics of the dataframe
dataframe_way5.describe()

,Maths,Sanskrit,Physics,Chemistry,History,Geography,English
count,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000
mean,90.600000,91.000000,83.200000,82.600000,81.400000,75.000000,81.400000
std,3.577709,1.224745,7.981228,8.648699,2.607681,3.316625,2.073644
min,87.000000,90.000000,75.000000,71.000000,78.000000,72.000000,78.000000
25%,88.000000,90.000000,78.000000,81.000000,80.000000,72.000000,81.000000
50%,90.000000,91.000000,80.000000,81.000000,82.000000,75.000000,82.000000
75%,92.000000,91.000000,89.000000,85.000000,82.000000,76.000000,83.000000
max,96.000000,93.000000,94.000000,95.000000,85.000000,80.000000,83.000000

In [25]:
#Sorting in ascending order
dataframe_way5.sort_values('Maths')

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam2     87        91       89         85       80         75       83
exam5     88        90       75         71       82         72       83
exam3     90        91       78         81       82         76       82
exam1     92        93       94         95       85         80       78
exam4     96        90       80         81       78         72       81

In [26]:
#Sorting in descending order
dataframe_way5.sort_values('Maths',ascending=False)

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam4     96        90       80         81       78         72       81
exam1     92        93       94         95       85         80       78
exam3     90        91       78         81       82         76       82
exam5     88        90       75         71       82         72       83
exam2     87        91       89         85       80         75       83

In [27]:
#Adding all the values along rows
dataframe_way5['Total']=dataframe_way5.sum(axis = 1)  #Axis 1 means it will sum the value in a row or in another word all the column value in a row
dataframe_way5

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English  Total
exam1     92        93       94         95       85         80       78    617
exam2     87        91       89         85       80         75       83    590
exam3     90        91       78         81       82         76       82    580
exam4     96        90       80         81       78         72       81    578
exam5     88        90       75         71       82         72       83    561

In [28]:
#Dropping a column
dataframe_way5=dataframe_way5.drop(columns=['Total'])
dataframe_way5

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam1     92        93       94         95       85         80       78
exam2     87        91       89         85       80         75       83
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81
exam5     88        90       75         71       82         72       83

In [29]:
#Filter on one condition
dataframe_way5.loc[dataframe_way5.Maths >= 90]

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam1     92        93       94         95       85         80       78
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81

In [30]:
#Filter on more than one condition
dataframe_way5.loc[(dataframe_way5.Maths >= 90) & (dataframe_way5.English >= 80)]

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81

In [31]:
coronadata={'State':['Jharkhand','Jharkhand','Jharkhand','Bihar','Bihar','Bihar','Karnataka','Karnataka','Karnataka'],'City':['Daltonganj','Ranchi','Jamshedpur','Patna','Gaya','Begusarai','Bangalore','Mysore','Hampi'],'Cases':[4567,4321,6782,5437,8723,1234,9840,6534,7450],'Date':['5/7/2020','5/7/2020','4/7/2020','4/7/2020','5/7/2020','5/7/2020','4/7/2020','4/7/2020','5/7/2020']}
coronadata_df=pd.DataFrame(coronadata)
coronadata_df

       State        City  Cases      Date
0  Jharkhand  Daltonganj   4567  5/7/2020
1  Jharkhand      Ranchi   4321  5/7/2020
2  Jharkhand  Jamshedpur   6782  4/7/2020
3      Bihar       Patna   5437  4/7/2020
4      Bihar        Gaya   8723  5/7/2020
5      Bihar   Begusarai   1234  5/7/2020
6  Karnataka   Bangalore   9840  4/7/2020
7  Karnataka      Mysore   6534  4/7/2020
8  Karnataka       Hampi   7450  5/7/2020

In [32]:
#Grouping using one column
df = pd.DataFrame(coronadata_df)
print(df.groupby('State').groups)

{'Bihar': [3, 4, 5], 'Jharkhand': [0, 1, 2], 'Karnataka': [6, 7, 8]}

In [33]:
#Grouping using multiple column
df = pd.DataFrame(coronadata_df)
print(df.groupby(['State','Date']).groups)

{('Bihar', '4/7/2020'): [3], ('Bihar', '5/7/2020'): [4, 5], ('Jharkhand', '4/7/2020'): [2], ('Jharkhand', '5/7/2020'): [0, 1], ('Karnataka', '4/7/2020'): [6, 7], ('Karnataka', '5/7/2020'): [8]}

In [34]:
#Printing each value based on group
groupingbydate=pd.DataFrame(coronadata_df).groupby('Date')

for name,group in groupingbydate:
    print(name)
    print(group)

4/7/2020
       State        City  Cases      Date
2  Jharkhand  Jamshedpur   6782  4/7/2020
3      Bihar       Patna   5437  4/7/2020
6  Karnataka   Bangalore   9840  4/7/2020
7  Karnataka      Mysore   6534  4/7/2020
5/7/2020
       State        City  Cases      Date
0  Jharkhand  Daltonganj   4567  5/7/2020
1  Jharkhand      Ranchi   4321  5/7/2020
4      Bihar        Gaya   8723  5/7/2020
5      Bihar   Begusarai   1234  5/7/2020
8  Karnataka       Hampi   7450  5/7/2020

In [35]:
#Aggregation functions on grouped values
groupingbystate=pd.DataFrame(coronadata_df).groupby('State')
print(groupingbystate['Cases'].agg(np.sum)) ##Other methods are np.mean,np.size,np.sum, np.mean, np.std

State
Bihar        15394
Jharkhand    15670
Karnataka    23824
Name: Cases, dtype: int64

In [ ]:
A = {
        'id': ['1', '2', '3', '4', '5'],
        'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
        'B': ['B1', 'B2', 'B3', 'B4', 'B5']}
dataframe_A=pd.DataFrame(A)
dataframe_A

In [ ]:
B = {
        'id': ['1', '2', '6', '7', '8'],
        'A': ['A6', 'A7', 'A8', 'A9', 'A10'],
        'B': ['B6', 'B7', 'B8', 'B9', 'B10']}
dataframe_B=pd.DataFrame(B)
dataframe_B

In [ ]:
C = {
        'id': ['1', '2', '3', '4', '5','6','7','8','9','10'],
        'C': ['C1', 'C2', 'C3', 'C4', 'C5','C6','C7','C8','C9','C10']}
dataframe_C=pd.DataFrame(C)
dataframe_C

In [ ]:
df_concat=pd.concat([dataframe_A,dataframe_B]) #Along rows default
df_concat

In [ ]:
df_concat_reindex=pd.concat([dataframe_A,dataframe_B],ignore_index=True)
df_concat_reindex

In [ ]:
df_concat_alongcolumn=pd.concat([dataframe_A,dataframe_B],axis=1) #Along columns
df_concat_alongcolumn

In [ ]:
df_merge_col = pd.merge(df_concat, dataframe_C, on='id')

df_merge_col

In [ ]:
#Outer Join
df_outer = pd.merge(dataframe_A, dataframe_B, on='id', how='outer')

df_outer

In [ ]:
#Inner Join
df_inner = pd.merge(dataframe_A, dataframe_B, on='id', how='inner')

df_inner

In [ ]:
#Right Join
df_right = pd.merge(dataframe_A, dataframe_B, on='id', how='right')

df_right

In [ ]:
#Left Join
df_left = pd.merge(dataframe_A, dataframe_B, on='id', how='left')

df_left